burakenez/gd32h7xx-cmake-vscode/Examples/ENET/Telnet/Application/Core/Src/gd32h73x_75x_enet_eval.c
/*!
    \file    gd32h73x_75x_enet_eval.c
    \brief   ethernet hardware configuration

    \version 2026-03-24, V1.6.0, firmware for GD32H73x_75x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h73x_75x_enet.h"
#include "gd32h73x_75x_enet_eval.h"
#include "main.h"

#define PHY_ADDRESS_1                    ((uint16_t)1U)                         /*!< phy 1 address determined by the hardware */
#define PHY_ADDRESS_2                    ((uint16_t)1U)                         /*!< phy 2 address determined by the hardware */

const uint8_t gd32_str[] = {"\r\n ############ Welcome GigaDevice ############\r\n"};
static __IO uint32_t enet_init_status = 0;
static void enet_gpio_config(void);
static void enet_mac_dma_config(uint32_t enet_periph, uint16_t phy_address);
static void delay(uint32_t ncount);
static ErrStatus auto_negotiation_result_get(uint32_t enet_periph, uint16_t phy_address);
static ErrStatus phy_reset(uint32_t enet_periph, uint16_t phy_address);
#ifdef USE_ENET_INTERRUPT
static void nvic_configuration(void);
#endif /* USE_ENET_INTERRUPT */

__IO uint32_t spd_dpm = 0U;

/*!
    \brief      setup ethernet system(GPIOs, clocks, MAC, DMA, systick)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void enet_system_setup(void)
{
    uint32_t sys_frequency = 0;

    /* configure the GPIO ports for ethernet pins */
    enet_gpio_config();

#ifdef USE_ENET0
    /* configure the ENET0 MAC/DMA */
    enet_mac_dma_config(ENET0, PHY_ADDRESS_1);
#endif /* USE_ENET0 */

#ifdef USE_ENET1
    /* configure the ENET1 MAC/DMA */
    enet_mac_dma_config(ENET1, PHY_ADDRESS_2);
#endif /* USE_ENET1 */

    if(0 == enet_init_status) {
        while(1) {
        }
    }

#ifdef USE_ENET_INTERRUPT
    nvic_configuration();
#endif /* USE_ENET_INTERRUPT */

    /* configure systick clock source as HCLK */
    systick_clksource_set(SYSTICK_CLKSOURCE_CKSYS);

    /* an interrupt every 10ms */
    sys_frequency = rcu_clock_freq_get(CK_SYS);
    SysTick_Config(sys_frequency / 100);
}

/*!
    \brief      configures the ethernet interface
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void enet_mac_dma_config(uint32_t enet_periph, uint16_t phy_address)
{
    ErrStatus reval_state = ERROR;
#ifdef CHECKSUM_BY_HARDWARE
    enet_chksumconf_enum checksum = ENET_AUTOCHECKSUM_DROP_FAILFRAMES;
#else
    enet_chksumconf_enum checksum = ENET_NO_AUTOCHECKSUM;
#endif /* CHECKSUM_BY_HARDWARE */

    /* enable ethernet clock  */
    if(ENET0 == enet_periph) {
        rcu_periph_clock_enable(RCU_ENET0);
        rcu_periph_clock_enable(RCU_ENET0TX);
        rcu_periph_clock_enable(RCU_ENET0RX);
    } else if(ENET1 == enet_periph) {
        rcu_periph_clock_enable(RCU_ENET1);
        rcu_periph_clock_enable(RCU_ENET1TX);
        rcu_periph_clock_enable(RCU_ENET1RX);
    } else {
    }

    /* reset ethernet on AHB bus */
    enet_deinit(enet_periph);

    /* reset enet by software */
    reval_state = enet_software_reset(enet_periph);
    if(ERROR == reval_state) {
        while(1) {}
    }

    /* configure SMI MDC clock frequency division */
    enet_phy_config(enet_periph);

    /* reset PHY then initialize ENET */
    if(SUCCESS == phy_reset(enet_periph, phy_address)) {
        /* auto negotiation */
        if(SUCCESS == auto_negotiation_result_get(enet_periph, phy_address)) {
            enet_init_status = enet_init(enet_periph, (enet_mediamode_enum)spd_dpm, (enet_chksumconf_enum)checksum, ENET_BROADCAST_FRAMES_PASS);
        }
    }
}

#ifdef USE_ENET_INTERRUPT
/*!
    \brief      configures the nested vectored interrupt controller
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void nvic_configuration(void)
{
    nvic_priority_group_set(NVIC_PRIGROUP_PRE4_SUB0);

#ifdef USE_ENET0
    nvic_irq_enable(ENET0_IRQn, 0, 0);
    enet_interrupt_enable(ENET0, ENET_DMA_INT_NIE);
    enet_interrupt_enable(ENET0, ENET_DMA_INT_RIE);

#if SELECT_DESCRIPTORS_ENHANCED_MODE
    enet_desc_select_enhanced_mode(ENET0);
#endif /* SELECT_DESCRIPTORS_ENHANCED_MODE */
#endif /* USE_ENET0 */
#ifdef USE_ENET1
    nvic_irq_enable(ENET1_IRQn, 0, 0);
    enet_interrupt_enable(ENET1, ENET_DMA_INT_NIE);
    enet_interrupt_enable(ENET1, ENET_DMA_INT_RIE);

#if SELECT_DESCRIPTORS_ENHANCED_MODE
    enet_desc_select_enhanced_mode(ENET1);
#endif /* SELECT_DESCRIPTORS_ENHANCED_MODE */
#endif /* USE_ENET1 */
}
#endif /* USE_ENET_INTERRUPT */

/*!
    \brief      configures the different GPIO ports
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void enet_gpio_config(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_GPIOD);
    rcu_periph_clock_enable(RCU_GPIOE);
    rcu_periph_clock_enable(RCU_GPIOG);
    rcu_periph_clock_enable(RCU_GPIOH);

