burakenez/gd32h7xx-cmake-vscode/Examples/ENET/Telnet/Application/Core/Src/gd32h73x_75x_enet_eval.c
    /* PH11: ETH1_RMII_CRS_DV */
    gpio_mode_set(GPIOH, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOH, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_11);

    /* PH12: ETH1_RMII_REF_CLK */
    gpio_mode_set(GPIOH, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_12);
    gpio_output_options_set(GPIOH, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_12);

    /* PH14: ETH1_MDIO */
    gpio_mode_set(GPIOH, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_14);
    gpio_output_options_set(GPIOH, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_14);


    gpio_af_set(GPIOH, GPIO_AF_6, GPIO_PIN_8);
    gpio_af_set(GPIOH, GPIO_AF_6, GPIO_PIN_9);
    gpio_af_set(GPIOH, GPIO_AF_6, GPIO_PIN_11);
    gpio_af_set(GPIOH, GPIO_AF_6, GPIO_PIN_12);
    gpio_af_set(GPIOH, GPIO_AF_6, GPIO_PIN_14);

    /* PG6: ETH1_MDC */
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_6);

    /* PG11: ETH1_RMII_TX_EN */
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_11);

    /* PG13: ETH1_RMII_TXD0 */
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_13);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_13);

    /* PG14: ETH1_RMII_TXD1 */
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_14);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_14);

    gpio_af_set(GPIOG, GPIO_AF_6, GPIO_PIN_6);
    gpio_af_set(GPIOG, GPIO_AF_6, GPIO_PIN_11);
    gpio_af_set(GPIOG, GPIO_AF_6, GPIO_PIN_13);
    gpio_af_set(GPIOG, GPIO_AF_6, GPIO_PIN_14);

#endif /* MII_MODE */
#endif /* USE_ENET1 */
}

/*!
    \brief      reset phy
    \param[in]  phy_address: phy address
    \param[out] none
    \retval     ERROR or SUCCESS
*/
static ErrStatus phy_reset(uint32_t enet_periph, uint16_t phy_address)
{
    ErrStatus state = ERROR;
    uint16_t phy_value;
    uint32_t timeout = 0U;

    /* reset PHY */
    phy_value = PHY_RESET;
    if(SUCCESS == enet_phy_write_read(enet_periph, ENET_PHY_WRITE, phy_address, PHY_REG_BCR, &phy_value)) {
        /* PHY reset need some time */
        delay(ENET_DELAY_TO);

        /* check whether PHY reset is complete */
        if(SUCCESS == enet_phy_write_read(enet_periph, ENET_PHY_READ, phy_address, PHY_REG_BCR, &phy_value)) {
            /* PHY reset complete */
            if(RESET == (phy_value & PHY_RESET)) {
                /* wait for PHY_LINKED_STATUS bit be set */
                do {
                    enet_phy_write_read(enet_periph, ENET_PHY_READ, phy_address, PHY_REG_BSR, &phy_value);
                    phy_value &= PHY_LINKED_STATUS;
                    timeout++;
                } while((RESET == phy_value) && (timeout < PHY_READ_TO));

                /* check for timeout */
                if(PHY_READ_TO != timeout) {
                    /* reset timeout counter */
                    timeout = 0U;
                    state = SUCCESS;
                }
            }
        }
    }
    return state;
}

/*!
    \brief      get auto negotiation result
    \param[in]  phy_address: phy address
    \param[out] none
    \retval     ERROR or SUCCESS
*/
static ErrStatus auto_negotiation_result_get(uint32_t enet_periph, uint16_t phy_address)
{
    ErrStatus state = ERROR;
    uint16_t phy_value;
    uint32_t timeout = 0U;

    /* enable auto-negotiation */
    phy_value = PHY_AUTONEGOTIATION;
    if(SUCCESS == enet_phy_write_read(enet_periph, ENET_PHY_WRITE, phy_address, PHY_REG_BCR, &phy_value)) {
        /* wait for the PHY_AUTONEGO_COMPLETE bit be set */
        do {
            enet_phy_write_read(enet_periph, ENET_PHY_READ, phy_address, PHY_REG_BSR, &phy_value);
            phy_value &= PHY_AUTONEGO_COMPLETE;
            timeout++;
        } while((RESET == phy_value) && (timeout < (uint32_t)PHY_READ_TO));

        /* check for timeout */
        if(PHY_READ_TO != timeout) {
            /* reset timeout counter */
            timeout = 0U;
            /* read the result of the auto-negotiation */
            enet_phy_write_read(enet_periph, ENET_PHY_READ, phy_address, PHY_SR, &phy_value);
            /* configure the duplex mode of MAC following the auto-negotiation result */
            if((uint16_t)RESET != (phy_value & PHY_DUPLEX_STATUS)) {
                spd_dpm = ENET_MODE_FULLDUPLEX;
            } else {
                spd_dpm = ENET_MODE_HALFDUPLEX;
            }
            /* configure the communication speed of MAC following the auto-negotiation result */
            if((uint16_t)RESET != (phy_value & PHY_SPEED_STATUS)) {
                spd_dpm |= ENET_SPEEDMODE_10M;
            } else {
                spd_dpm |= ENET_SPEEDMODE_100M;
            }
            state = SUCCESS;
        }
    }

    return state;
}

/*!
    \brief      insert a delay time
    \param[in]  ncount: specifies the delay time length
    \param[out] none
    \param[out] none
*/
static void delay(uint32_t ncount)
{
    __IO uint32_t delay_time = 0U;

    for(delay_time = ncount; delay_time != 0U; delay_time--) {
    }
}
